In [52]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [53]:
#Loading in the data
calendar_df = pd.read_csv('../Data/calendar.csv',parse_dates=['date'])
reviews_df = pd.read_csv('../Data/reviews.csv',parse_dates=['date'])

In [54]:
#I am only interested in the data that is available 
#Additionally, I only need the price and the date
cal_df = calendar_df[calendar_df['available'] == 't'].drop(['listing_id','available'],axis=1)

In [55]:
#I want to see the amount of listings both on a monthly basis and day of the week
#So I will add columns to help with this
#cal_df['month'] = pd.DatetimeIndex(cal_df['date']).month
cal_df['day_of_week'] = cal_df['date'].dt.day_name()
cal_df['Month'] = cal_df['date'].dt.strftime('%b')

In [ ]:
#Starting with the month I want to see

In [63]:
#len(pd.unique(df['height']))
len(pd.unique(calendar_df['listing_id']))

3818

In [56]:
cal_df.sample(5)

              date    price day_of_week Month
386972  2016-03-16  $149.00   Wednesday   Mar
421166  2016-11-20  $115.00      Sunday   Nov
907278  2016-09-13  $110.00     Tuesday   Sep
288123  2016-05-21   $95.00    Saturday   May
1191366 2016-01-10   $75.00      Sunday   Jan

In [7]:
calendar_df.sample(5)

         listing_id       date available    price
1359283     7217102 2016-01-27         t  $232.00
186998      6262987 2016-05-01         f      NaN
442698      5736082 2016-11-17         t   $45.00
250621       977722 2016-08-22         f      NaN
1211772     9675736 2016-12-06         f      NaN

In [10]:
len(calendar_df['date'])

1393570

In [12]:
len(cal_df)

934542

In [13]:
cal_df.sample(5)

        listing_id       date available    price
390649     3385421 2016-04-12         t  $557.00
535823     9863312 2016-01-07         t   $99.00
991379     9494946 2016-02-12         t   $89.00
564946     2191169 2016-10-21         t  $291.00
863007     1827586 2016-05-30         t  $375.00

In [14]:
cal_df_2 = calendar_df[calendar_df['available'] == 't'].drop(['listing_id','available'],axis=1)

In [15]:
cal_df_2.sample(5)

              date    price
362271  2016-07-13  $225.00
892466  2016-02-14   $63.00
567602  2016-01-31  $100.00
1271910 2016-09-10   $85.00
153952  2016-10-17   $40.00

In [18]:
reviews_df.sample(5)

,listing_id,id,date,reviewer_id,reviewer_name,comments
67079,699460,26935759,2015-02-22,5774048,Alice,Great stay - really nice and characterful hous...
17007,7350870,48637557,2015-09-27,4446940,Todd,Stunning views and perfectly located.\nIf your...
69532,2526405,45421142,2015-09-02,19690987,Austin,Great spot in cap hill close to good coffee an...
52871,793629,48420422,2015-09-26,3336152,Jenni,"Absolutely loved Candace's home! Cute, cozy co..."
35929,4100009,27210238,2015-02-28,5041037,Rachel,The appartment was great. Even nicer than pic...

In [34]:
listings_df = pd.read_csv('../Data/listings.csv',parse_dates=['last_scraped'])

In [39]:
print(listings_df['last_scraped'].min())
print(listings_df['last_scraped'].max())
print(cal_df['date'].min())
print(cal_df['date'].max())

2016-01-04 00:00:00
2016-01-04 00:00:00
2016-01-04 00:00:00
2017-01-02 00:00:00

In [21]:
listings_df.sample(5)

,id,listing_url,scrape_id,last_scraped,name,summary,space,description,experiences_offered,neighborhood_overview,...,review_scores_value,requires_license,license,jurisdiction_names,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification,calculated_host_listings_count,reviews_per_month
2458,107046,https://www.airbnb.com/rooms/107046,20160104002432,2016-01-04,"Beautiful, Artistic Home, near UW",Why not stay in a quintessential Seattle Bunga...,This charming Seattle Bungalow was built in th...,Why not stay in a quintessential Seattle Bunga...,none,Our neighborhood is a quiet residential area b...,...,10.0,f,NaN,WASHINGTON,f,strict,f,f,1,0.45
2942,1520549,https://www.airbnb.com/rooms/1520549,20160104002432,2016-01-04,Io House (2P #1) - SLU walkable,NaN,About Io House: This is a home for itinerant t...,About Io House: This is a home for itinerant t...,none,NaN,...,9.0,f,NaN,WASHINGTON,f,strict,f,f,37,0.16
1257,6364549,https://www.airbnb.com/rooms/6364549,20160104002432,2016-01-04,Affordable Downtown Studio,550 s.f. studio with a queen bed and a cush so...,"Affordable, close to Pike Place Market, quiet ...",550 s.f. studio with a queen bed and a cush so...,none,There are a TON of great restaurants in the ne...,...,10.0,f,NaN,WASHINGTON,f,moderate,f,f,1,2.45
759,9976135,https://www.airbnb.com/rooms/9976135,20160104002432,2016-01-04,Cute room right by express lane,My room is located in an apartment called Shan...,NaN,My room is located in an apartment called Shan...,none,NaN,...,NaN,f,NaN,WASHINGTON,f,flexible,f,f,1,NaN
1371,2186330,https://www.airbnb.com/rooms/2186330,20160104002432,2016-01-04,Downtown Seattle Near Pike Pl! MT2,The Metropolitan Tower property is centrally l...,"AMAZING BUILDING, AMENITIES, AND LOCATION WITH...",The Metropolitan Tower property is centrally l...,none,In the heart of Downtown Seattle! Nearby Attra...,...,8.0,f,NaN,WASHINGTON,f,strict,f,f,1,1.11

In [22]:
listings_df.columns

Index(['id', 'listing_url', 'scrape_id', 'last_scraped', 'name', 'summary',
       'space', 'description', 'experiences_offered', 'neighborhood_overview',
       'notes', 'transit', 'thumbnail_url', 'medium_url', 'picture_url',
       'xl_picture_url', 'host_id', 'host_url', 'host_name', 'host_since',
       'host_location', 'host_about', 'host_response_time',
       'host_response_rate', 'host_acceptance_rate', 'host_is_superhost',
       'host_thumbnail_url', 'host_picture_url', 'host_neighbourhood',
       'host_listings_count', 'host_total_listings_count',
       'host_verifications', 'host_has_profile_pic', 'host_identity_verified',
       'street', 'neighbourhood', 'neighbourhood_cleansed',
       'neighbourhood_group_cleansed', 'city', 'state', 'zipcode', 'market',
       'smart_location', 'country_code', 'country', 'latitude', 'longitude',
       'is_location_exact', 'property_type', 'room_type', 'accommodates',
       'bathrooms', 'bedrooms', 'beds', 'bed_type', 'amenities', 'square_feet',
       'price', 'weekly_price', 'monthly_price', 'security_deposit',
       'cleaning_fee', 'guests_included', 'extra_people', 'minimum_nights',
       'maximum_nights', 'calendar_updated', 'has_availability',
       'availability_30', 'availability_60', 'availability_90',
       'availability_365', 'calendar_last_scraped', 'number_of_reviews',
       'first_review', 'last_review', 'review_scores_rating',
       'review_scores_accuracy', 'review_scores_cleanliness',
       'review_scores_checkin', 'review_scores_communication',
       'review_scores_location', 'review_scores_value', 'requires_license',
       'license', 'jurisdiction_names', 'instant_bookable',
       'cancellation_policy', 'require_guest_profile_picture',
       'require_guest_phone_verification', 'calculated_host_listings_count',
       'reviews_per_month'],
      dtype='object')

In [25]:
listings_df[['neighbourhood', 'neighbourhood_cleansed','neighbourhood_group_cleansed']].sample(5)

         neighbourhood neighbourhood_cleansed neighbourhood_group_cleansed
3196  Lower Queen Anne       Lower Queen Anne                   Queen Anne
2782      Capitol Hill               Broadway                 Capitol Hill
2404        Maple Leaf             Maple Leaf                    Northgate
1304          Belltown               Belltown                     Downtown
1667      Capitol Hill             First Hill                     Downtown

In [30]:
listings_df['neighbourhood'].value_counts()

Capitol Hill          351
Ballard               213
Belltown              204
Minor                 192
Queen Anne            187
                     ...
South Park              2
Pike Market             2
Fairmount Park          1
North College Park      1
Roxhill                 1
Name: neighbourhood, Length: 81, dtype: int64

In [31]:
listings_df['neighbourhood_cleansed'].value_counts()

Broadway             397
Belltown             234
Wallingford          167
Fremont              158
Minor                135
                    ...
Arbor Heights          5
Pinehurst              4
South Beacon Hill      4
South Park             3
Roxhill                2
Name: neighbourhood_cleansed, Length: 87, dtype: int64

In [32]:
listings_df['neighbourhood_group_cleansed'].value_counts()

Other neighborhoods    794
Capitol Hill           567
Downtown               530
Central Area           369
Queen Anne             295
Ballard                230
West Seattle           203
Rainier Valley         159
University District    122
Beacon Hill            118
Cascade                 89
Northgate               80
Delridge                79
Lake City               67
Magnolia                61
Seward Park             44
Interbay                11
Name: neighbourhood_group_cleansed, dtype: int64

In [40]:
listings_df[['price', 'weekly_price', 'monthly_price']].sample(5)

        price weekly_price monthly_price
2565  $110.00      $690.00     $2,595.00
3156  $135.00      $850.00           NaN
3190  $150.00          NaN           NaN
3375   $50.00      $300.00     $1,050.00
1561  $150.00      $875.00           NaN

In [41]:
listings_df[['price', 'weekly_price', 'monthly_price']].isna().sum()

price               0
weekly_price     1809
monthly_price    2301
dtype: int64